/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Ampliació Telesec";
"06 06 02 82 06 01 0A 01"		= "Mecanisme Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Autenticació Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autenticació de contrasenya";
"06 08 02 82 06 01 0A 01 00 02" = "Autenticació de contrasenya protegida";
"06 08 02 82 06 01 0A 01 00 03" = "Autenticació X.509 unidireccional";
"06 08 02 82 06 01 0A 01 00 04" = "Autenticació X.509 bidireccional";
"06 08 02 82 06 01 0A 01 00 05" = "Autenticació X.509 tridireccional";
"06 08 02 82 06 01 0A 01 00 06" = "Autenticació ISO9798 unidireccional";
"06 08 02 82 06 01 0A 01 00 07" = "Autenticació ISO9798 bidireccional";
"06 08 02 82 06 01 0A 01 00 08" = "Autenticació Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Firma Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 amb RSA i ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 amb RSA i estàndard de firma Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 amb RSA i ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 amb RSA i estàndard de firma Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 amb RSA i estàndard de firma Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Firma RSA HBCI";

"06 07 02 82 06 01 0A 01 02"	= "Encriptació Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "cap";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Funció unidireccional";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash amb xifratge de bloc";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funció FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Mòdul Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algorismes";
"06 07 02 82 06 01 0A 02 01"	= "Tipus d’atribut";
"06 07 02 82 06 01 0A 02 02"	= "Tipus de certificat";
"06 07 02 82 06 01 0A 02 03"	= "Tipus de missatge";
"06 07 02 82 06 01 0A 02 04"	= "Protocol PL";
"06 07 02 82 06 01 0A 02 05"	= "SME i components d’SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definicions útils";
"06 07 02 82 06 01 0A 02 08"	= "Arxius STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Comanda electrònica";
"06 07 02 82 06 01 0A 02 0B"	= "Aplicació asimètrica Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Aplicació de base Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Missatges Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Aplicació de segell horari Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Classe d’objecte";
"06 07 02 82 06 01 0A 03 00"	= "Nom alternatiu Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Directori";
"06 07 02 82 06 01 0A 03 02"	= "Tipus de directori";
"06 07 02 82 06 01 0A 03 03"	= "Grup de directoris";
"06 07 02 82 06 01 0A 03 04"	= "Usuari de directoris";
"06 07 02 82 06 01 0A 03 05"	= "Entrada de clau simètrica";

"06 06 02 82 06 01 0A 04"		= "Paquet";
"06 06 02 82 06 01 0A 05"		= "Paràmetre";
"06 06 02 82 06 01 0A 06"		= "Unió de noms";
"06 06 02 82 06 01 0A 07"		= "Atribut";
"06 07 02 82 06 01 0A 07 00"	= "Identificador de grup d’aplicacions";
"06 07 02 82 06 01 0A 07 01"	= "Tipus de certificat";
"06 07 02 82 06 01 0A 07 02"	= "Certificat Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Número de certificat";
"06 07 02 82 06 01 0A 07 04"	= "Llista de revocació de certificats";
"06 07 02 82 06 01 0A 07 05"	= "Data de creació";
"06 07 02 82 06 01 0A 07 06"	= "Emissor";
"06 07 02 82 06 01 0A 07 07"	= "Autoritat de noms";
"06 07 02 82 06 01 0A 07 08"	= "Directori de clau pública";
"06 07 02 82 06 01 0A 07 09"	= "Domini de seguretat";
"06 07 02 82 06 01 0A 07 0A"	= "Tema";
"06 07 02 82 06 01 0A 07 0B"	= "Temps de revocació";
"06 07 02 82 06 01 0A 07 0C"	= "Referència de grup d’usuaris";
"06 07 02 82 06 01 0A 07 0D"	= "Validesa";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Entorn de missatges de seguretat";
"06 07 02 82 06 01 0A 07 10"	= "Directori de claus públiques anònimes";
"06 07 02 82 06 01 0A 07 11"	= "Nom de pila Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Addicions de nom";
"06 07 02 82 06 01 0A 07 13"	= "Codi postal Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Indicador de DN";
"06 07 02 82 06 01 0A 07 15"	= "Llista de certificats Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Llista de certificats Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Llista de certificats X.509";
"06 07 02 82 06 01 0A 07 18"	= "Hora d’emissió";
"06 07 02 82 06 01 0A 07 19"	= "Número de targeta física";
"06 07 02 82 06 01 0A 07 1A"	= "Tipus d’arxiu";
"06 07 02 82 06 01 0A 07 1B"	= "Arxiu Ctl comprimit";
"06 07 02 82 06 01 0A 07 1C"	= "Adreça de correu";
"06 07 02 82 06 01 0A 07 1D"	= "Llista de plantilles de certificats";
"06 07 02 82 06 01 0A 07 1E"	= "Nom de directori";
"06 07 02 82 06 01 0A 07 1F"	= "Nom de tipus de directori";
"06 07 02 82 06 01 0A 07 20"	= "Nom de grup de directori";
"06 07 02 82 06 01 0A 07 21"	= "Nom d’usuari de directoris";
"06 07 02 82 06 01 0A 07 22"	= "Senyal de revocació";
"06 07 02 82 06 01 0A 07 23"	= "Nom d’entrada de clau simètrica";
"06 07 02 82 06 01 0A 07 24"	= "Número GL";
"06 07 02 82 06 01 0A 07 25"	= "Número GO";
"06 07 02 82 06 01 0A 07 26"	= "Dades de clau G";
"06 07 02 82 06 01 0A 07 27"	= "Dades de clau Z";
"06 07 02 82 06 01 0A 07 28"	= "Dades de clau KT";
"06 07 02 82 06 01 0A 07 2A"	= "Número de clau KT";
"06 07 02 82 06 01 0A 07 33"	= "Temps de generació de la revocació";
"06 07 02 82 06 01 0A 07 34"	= "Text sobre responsabilitat";

"06 06 02 82 06 01 0A 08"		= "Grup d’atributs";
"06 06 02 82 06 01 0A 09"		= "Acció";
"06 06 02 82 06 01 0A 0A"		= "Notificació";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplicació de seguretat";

"06 06 02 82 06 01 0A 0C"		= "Definicions d’ampliació de certificats i CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Ampliació de la limitació de responsabilitat de l’ampliació de certificat";
"06 07 02 82 06 01 0A 0C 01"	= "Ampliació d’ID de certificat Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identificador de política Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID de qualificador de política Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Ampliació filtrada Telesec CRL";
"06 07 02 82 06 01 0A 0C 05"	= "Ampliació de filtre CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Ampliació d’autoritat de noms Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID d’usuari";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Bústia RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Component de domini";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Número d’activitat comercial australià";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identificador de política australiana de certificats";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Segell personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Segell d’empresa";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Segell legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Segell pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Segell IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Identificador de política de segell";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algorisme d’encriptació simètrica";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "CP SEIS";
"06 06 2A 85 70 22 01 01"	= "Identificador de política d’alta seguretat SEIS";
"06 06 2A 85 70 22 01 02"	= "Identificador de política SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Identificador personal SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Mòdul ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Gestió de certificats X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrucció de suspensió";
"06 07 2A 86 48 CE 38 02 01"	= "Cap instrucció de suspensió";
"06 07 2A 86 48 CE 38 02 02"	= "Emissor de la trucada";
"06 07 2A 86 48 CE 38 02 03"	= "Refusar";
"06 07 2A 86 48 CE 38 02 04"	= "Senyal d’elecció";
"06 06 2A 86 48 CE 38 03"		= "Atribut";
"06 06 2A 86 48 CE 38 03 01"	= "Contrafirma";
"06 06 2A 86 48 CE 38 03 02"	= "Certificat d’atributs";
"06 06 2A 86 48 CE 38 04"		= "Algorisme";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA amb SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tipus de camp ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Camp principal";
"06 07 2A 86 48 CE 3D 01 02"	= "Camp de característica 2";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Base de característica 2";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base nul·la";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base trinomial";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base pentanomial";
"06 06 2A 86 48 CE 3D 02"		= "Tipus de clau pública";
"06 07 2A 86 48 CE 3D 02 01"	= "Clau pública de corba el·líptica";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tipus de camp ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Camp Galois principal";
"06 06 2A 86 48 CE 3E 02"		= "Tipus de número";
"06 07 2A 86 48 CE 3E 02 01"	= "Clau pública Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Esquema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman estàtic";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efímer";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman híbrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman híbrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Dades de versió d’Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE amb MD5 i CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC per contrasenya";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Usuari d’Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Dades de CA Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificat d’atributs";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Encriptació RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Encriptació RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Etiqueta RSA-OAEP especificada";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Esquema de firmes RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 amb encriptació RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 amb encriptació RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Encriptació RSA BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Contracte de clau Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE amb MD2 i DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE amb MD5 i DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE amb MD2 i RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE amb MD5 i RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE amb MD5 i XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE amb SHA i DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dades";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Dades firmades";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dades protegides";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Dades firmades i protegides";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Dades Digest";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dades encriptades";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dades amb atributs";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informació de clau privada encriptada";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Adreça de correu";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nom sense estructura";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tipus de contingut";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Message Digest";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Data i hora de firma";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Contrafirma";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Contrasenya de comprovació";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Adreça sense estructura";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atributs de certificat ampliats";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emissor i número de sèrie";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Comprovació de contrasenya";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Clau pública";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descripció de firma";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Petició d’ampliació";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Funcions S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferir dades firmades";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "No se’n pot desxifrar cap";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Petició de confirmació";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Confirmació";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Indicacions de contingut";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Historial d’ampliació de llista de correu";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Mòduls S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaxi de missatges xifrats";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Serveis de seguretat millorats";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identificador d’objecte S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Missatge S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Firma electrònica ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Firma electrònica ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Política de firma electrònica ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Política de firma electrònica ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Tipus de contingut S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Atributs autenticats per S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algorismes S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribució de certificats S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribució de certificats LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Qualificador de política de firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identificador de tipus de firma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Firma del creador";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Firma de domini";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Firma d’atributs addicionals";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Revisar firma";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Funcions S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferir binari intern";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nom descriptiu (per a PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID de clau local (per a PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipus de certificat (per a PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificat X.509 (per a PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificat SDSI (per a PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipus de CRL (per a PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (per a PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintaxi d’intercanvi de dades personals PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID d’encriptació per contrasenya PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE amb SHA-1 i RC4 de 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE amb SHA-1 i RC4 de 40 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE amb SHA-1 i DES-CBC triple de 3 claus";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE amb SHA-1 i DES-CBC triple de 2 claus";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE amb SHA-1 i RC2-CBC de 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE amb SHA-1 i RC2-CBC de 40 bits";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "ID PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Cobertura de claus PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID de paquet PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID de paquet de claus PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Certificat PKCS-12 i ID de paquet CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID de paquet secret PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID de contingut segur PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID de paquet de clau encoberta PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID de paquet de certificats PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Certificat PKCS-12 X.509 i ID de paquet CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID de paquet de certificats PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "ID d’objecte PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID d’encriptació per contrasenya PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE amb SHA-1 i RC4 de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE amb SHA-1 i RC4 de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE amb SHA-1 i DES-CBC triple";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE amb SHA-1 i RC2-CBC de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE amb SHA-1 i RC2-CBC de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE amb SHA-1 i RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE amb SHA-1 i RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID de protecció PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Encriptació RSA PKCS-12 amb RC4 de 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Encriptació RSA PKCS-12 amb RC4 de 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Encriptació RSA PKCS-12 amb DES Triple";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID de firma PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Firma RSA PKCS-12 amb SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 versió 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID de paquet PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Paquet de claus PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Paquet de clau encoberta PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Paquet de certificats PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Paquet CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Paquet secret PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Paquet de contingut segur PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Mòduls PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atributs PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Tipus de contingut PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Contingut PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algorisme RSADSI Digest";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC amb SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algorisme d’encriptació RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 amb MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Pad RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificador de política desconeguda Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Kerberos d’usuari a usuari MIT";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Classe d’objecte de Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Encaminament de llocs";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Esquema de classe";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Esquema d’atributs";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agent-Bústia";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Bústia";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Contenidor";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatari de correu";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mecanisme d'entrega";

"06 07 2A 86 48 86 F7 14 04"				= "Formats d’arxiu de Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Context de dades indirectes SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Dades d’agència SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Tipus d’instrucció SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Dades SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Ampliacions de certificat SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Dades d’imatge SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Enllaç SPC (tipus 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Firma de codi individual";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Firma de codi comercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Enllaç SPC (tipus 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Criteris mínims SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Criteris financers SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Enllaç SPC (tipus 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Proveïdor de suport de seguretat NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Contrafirma de segell horari";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Llista de certificats de confiança";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Ampliació CTL ordenada";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Pròxima ubicació d’actualització";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Ús de claus millorat";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Firma de llista de certificats de confiança";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Firma de segell horari";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Xifratge de passarel·la de servidor";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Encriptació serializada";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistemes d’arxius encriptats";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recuperació de sistemes d’arxius encriptats";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatible amb maquinari Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Firma NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Firma OEM de maquinari Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Firma NT integrada";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Firma de llista arrel de confiança";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinació qualificada";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recuperació de claus";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Firma del document";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identificadors d’objectes d’atribut";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atribut de confiança Sí/No";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "DRM de música de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualització DRM de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Llicències de Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Servidor de llicències de Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identificadors d’objectes PKCS-10 de Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificat de renovació";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Parell nom/valor de registre";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP de registre";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versió del sistema operatiu";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atributs PKCS-12 de Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Grup de claus de la màquina local";

"06 08 2B 06 01 04 01 82 37 14"				= "Infraestructura de registre de Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Ús de CTL de registre automàtic";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tipus de certificat de registre";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agent de registre";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Inici de sessió de targeta intel·ligent";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nom principal de NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infraestructura de servidor de certificats de Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versió de renovació de CA de Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versió de CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atribut de CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nom del document";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descripció del document";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dades encriptades";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Contingut encriptat";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identificador de política UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identificador de política ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identificador de política de CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal amb SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal amb RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atributs cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Comprovació de presència cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Resposta OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Resposta OCSP RTCS ampliada";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Raó ampliada de CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Propietats de la clau";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Inicialització PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Contingut cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dades de configuració cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Índex d’usuaris cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Dades d’usuaris cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identificador de política XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Prova horària";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistema de firma horària";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistema de firma horària 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistema de firma horària 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistema de firma horària 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Pràctiques secundàries";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificadors mèdics";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Dades d’autenticació Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dades de clau Diffie-Hellman Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Dades de clau de resposta Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Autenticació de client Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centre distrib. de claus (KDC) Kerberos";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (mecanisme de clau pública simple)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infraestructura de clau pública";

"06 07 2B 06 01 05 05 07 01"		= "Ampliacions de certificat privat PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Accés a les dades de l’autoritat de certificació";
"06 08 2B 06 01 05 05 07 01 02"		= "Dades biomètriques";
"06 08 2B 06 01 05 05 07 01 03"		= "Declaracions de certificat qualificat";
"06 08 2B 06 01 05 05 07 01 04"		= "Identitat de responsabilitat del certificat d’atributs";
"06 08 2B 06 01 05 05 07 01 05"		= "Destinació del certificat d’atributs";
"06 08 2B 06 01 05 05 07 01 06"		= "Controls de l’autoritat de certificació d’atributs";
"06 08 2B 06 01 05 05 07 01 07"		= "Bloc d’adreces IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Identificador de sistema autònom SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identificador d’encaminador SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Creació de proxy de certificat d’atributs";
"06 08 2B 06 01 05 05 07 01 0B"		= "Accés a les dades del subjecte";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotip";

"06 07 2B 06 01 05 05 07 02"		= "Tipus de qualificador de política";
"06 08 2B 06 01 05 05 07 02 01"		= "Declaració de pràctiques de certificació";
"06 08 2B 06 01 05 05 07 02 02"		= "Avís a l’usuari";
"06 08 2B 06 01 05 05 07 02 03"		= "Avís de text";

"06 07 2B 06 01 05 05 07 03"		= "Finalitat de la clau";
"06 08 2B 06 01 05 05 07 03 01"		= "Autenticació de servidor";
"06 08 2B 06 01 05 05 07 03 02"		= "Autenticació de client";
"06 08 2B 06 01 05 05 07 03 03"		= "Firma de codi";
"06 08 2B 06 01 05 05 07 03 04"		= "Protecció de correu electrònic";
"06 08 2B 06 01 05 05 07 03 05"		= "Sistema final IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Túnel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Usuari IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Segell horari";
"06 08 2B 06 01 05 05 07 03 09"		= "Firma OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Autenticació de servidor SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Tipus de dades CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificat d’encriptació del protocol de CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Tipus de parells de claus de firma";
"06 08 2B 06 01 05 05 07 04 03"		= "Tipus de parells de claus d’encriptació";
"06 08 2B 06 01 05 05 07 04 04"		= "Algorisme simètric preferit";
"06 08 2B 06 01 05 05 07 04 05"		= "Dades d’actualització de claus de CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL actual";
"06 08 2B 06 01 05 05 07 04 07"		= "ID d’objecte no compatibles";
"06 08 2B 06 01 05 05 07 04 08"		= "Sol·licitud de subscripció";
"06 08 2B 06 01 05 05 07 04 09"		= "Resposta a la subscripció";
"06 08 2B 06 01 05 05 07 04 0A"		= "Petició de paràmetres de parells de claus";
"06 08 2B 06 01 05 05 07 04 0B"		= "Resposta de paràmetres de parells de claus";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registre CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Control de registre";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Senyal de registre";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autenticador";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Dades de publicació PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opcions d'arxivament PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID de certificat antic";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Clau d’encriptació de protocol";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Plantilla de certificat alternativa";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Plantilla WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Dades de registre CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Parells UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Petició de certificat";

"06 07 2B 06 01 05 05 07 06"		= "Algorismes";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Sense firma";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controls CMC";

"06 07 2B 06 01 05 05 07 08"		= "Noms alternatius";
"06 08 2B 06 01 05 05 07 08 01"		= "Dades personals";
"06 08 2B 06 01 05 05 07 08 02"		= "Grup d’usuaris";

"06 07 2B 06 01 05 05 07 09"		= "Dades personals";
"06 08 2B 06 01 05 05 07 09 01"		= "Data de naixement";
"06 08 2B 06 01 05 05 07 09 02"		= "Lloc de naixement";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudònim";
"06 08 2B 06 01 05 05 07 09 04"		= "Sexe";
"06 08 2B 06 01 05 05 07 09 05"		= "País de ciutadania";
"06 08 2B 06 01 05 05 07 09 06"		= "País de residència";

"06 07 2B 06 01 05 05 07 0A"		= "Certificat d’atributs";
"06 08 2B 06 01 05 05 07 0A 01"		= "Dades d’autenticació";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identitat d’accés";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identitat de càrrec";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grup";
"06 08 2B 06 01 05 05 07 0A 05"		= "Funció";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protocol d’estat del certificat en línia";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Resposta bàsica OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Ampliació d’identificador temporal OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referència de CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Resposta OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Comprovació de no-revocació OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Límit d'arxivament OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Localitzador de servei OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emissors de CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Segell horari";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE intermedi";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algorisme d’encriptació DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algorisme de hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algorisme de firma DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 amb RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 amb RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 amb RSA";
"06 05 2B 0E 03 02 03"				= "MD5 amb RSA";
"06 05 2B 0E 03 02 04"				= "MD4 amb encriptació RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N amb RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Firma RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA amb SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 amb firma RSA";
"06 05 2B 0E 03 02 0F"				= "SHA amb firma RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman amb mòdul comú";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA comú";
"06 05 2B 0E 03 02 15"				= "DSA comú amb SHA";
"06 05 2B 0E 03 02 16"				= "Transport de claus RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 amb firma RSA";
"06 05 2B 0E 03 02 19"				= "MD5 amb firma RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA amb SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA amb SHA-1 comú";
"06 05 2B 0E 03 02 1D"				= "SHA-1 amb encriptació RSA";
"06 05 2B 0E 03 03 01"				= "Mecanisme d’autenticació sòlida simple";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 amb RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 amb ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Document";
"06 04 2B 24 01 01"					= "Versió final";
"06 04 2B 24 01 02"					= "Esborrany";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algorisme";
"06 04 2B 24 03 01"					= "Algorisme d’encriptació";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Pad DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Pad DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "Pad DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Pad DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Pad DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Pad DES3-ECB ISO";
"06 07 2B 24 03 01 03 02 01"		= "Pad DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Pad DES3-CBC ISO";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Pad IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Pad IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Pad IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Pad IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Encriptació RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Pad BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Pad BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Pad BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Algorisme de hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 de longitud simple";
"06 05 2B 24 03 02 05"				= "MDC2 de longitud doble";
"06 04 2B 24 03 03"					= "Algorisme de firma";
"06 05 2B 24 03 03 01"				= "Firma RSA";

"06 06 2B 24 03 03 01 01"			= "Firma RSA amb SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Firma RSA amb SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Firma RSA amb SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Firma RSA amb SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Firma RSA amb SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Firma RSA amb SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Firma RSA amb SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Firma RSA amb SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Firma RSA amb SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Firma RSA amb SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Firma RSA amb SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Firma RSA amb SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Firma RSA amb SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Firma RSA amb SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Firma RSA amb SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Firma RSA amb SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Firma RSA amb SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Firma RSA amb SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Firma RSA amb SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Firma RSA amb SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Firma RSA amb SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Firma RSA amb SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Firma RSA amb SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Firma RSA amb SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Firma RSA amb SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Firma RSA amb SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Firma RSA amb RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Firma RSA amb RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Firma RSA amb RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Firma RSA amb RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Firma RSA amb RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Firma RSA amb RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Firma RSA amb RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Firma RSA amb RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Firma RSA amb RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Firma RSA amb RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Firma RSA amb RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Firma RSA amb RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Firma RSA amb RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Firma RSA amb RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Firma RSA amb RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Firma RSA amb RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Firma RSA amb RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Firma RSA amb RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Firma RSA amb RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Firma RSA amb RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Firma RSA amb RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Firma RSA amb RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Firma RSA amb RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Firma RSA amb RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Firma RSA amb RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Firma RSA amb RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Firma RSA amb RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Firma RSA amb RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Firma ECSIE";
"06 06 2B 24 03 03 02 01"			= "Firma ECSIE amb SHA-1";
"06 06 2B 24 03 03 02 02"			= "Firma ECSIE amb RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Firma ECSIE amb MD2";
"06 06 2B 24 03 03 02 04"			= "Firma ECSIE amb MD5";

"06 04 2B 24 03 04"					= "Esquema de firmes";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 amb RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 amb RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 amb RND";

"06 03 2B 24 04"					= "Atribut";
"06 03 2B 24 05"					= "Política";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API d’un fabricant específic";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API amb funcionalitat específica";
"06 03 2B 24 07"					= "Gestió de claus";
"06 04 2B 24 07 01"					= "Contracte de clau";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transferència de claus";
"06 05 2B 24 07 02 01"				= "ISO9796-2 amb encriptació RSA";

"06 05 2B 24 08 01 01"				= "Identificador de política Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Servei de directoris";

"06 05 2B 24 08 03 01"				= "Data de generació del certificat";
"06 05 2B 24 08 03 02"				= "Adquisició";
"06 05 2B 24 08 03 03"				= "Admissió";
"06 05 2B 24 08 03 04"				= "Límit monetari";
"06 05 2B 24 08 03 05"				= "Declaració de majoria d’edat";
"06 05 2B 24 08 03 06"				= "Número de sèrie de la targeta de circuit integrat";
"06 05 2B 24 08 03 07"				= "Referència de clau pública";
"06 05 2B 24 08 03 08"				= "Restricció";
"06 05 2B 24 08 03 09"				= "Obtenir si és permès";
"06 05 2B 24 08 03 0A"				= "Certificat sol·licitat";
"06 05 2B 24 08 03 0B"				= "Autoritats de noms";
"06 05 2B 24 08 03 0C"				= "Certificat en el directori des de";
"06 05 2B 24 08 03 0D"				= "Hash del certificat";

"06 05 2B 24 08 04 01"				= "Dades personals";
"06 05 2B 24 08 04 08"				= "Restricció";
"06 07 2B 24 08 05 01 01 01"		= "RSA SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA amb SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA amb RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA ampliat";
"06 07 2B 24 08 05 01 02 02"		= "DSA amb RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificat";
"06 05 2B 24 08 06 02"				= "Referència del certificat";
"06 05 2B 24 08 06 03"				= "Certificat d’atributs";
"06 05 2B 24 08 06 04"				= "Referència d’atribut";
"06 05 2B 24 08 06 05"				= "Nom de l’arxiu";
"06 05 2B 24 08 06 06"				= "Temps d’emmagatzematge";
"06 05 2B 24 08 06 07"				= "Mida de l’arxiu";
"06 05 2B 24 08 06 08"				= "Ubicació";
"06 05 2B 24 08 06 09"				= "Número de firma";
"06 05 2B 24 08 06 0A"				= "Generat automàticament";

"06 05 2B 24 08 07 01"				= "Tipus de presentació Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binari";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Ampliació de certificat Thawte";
"06 05 2B 65 01 04 01"				= "Extranet sòlida";

/* X.520 */

"06 02 55 04"		= "Tipus d’atributs X.520";
"06 03 55 04 00"	= "Classe d’objecte";
"06 03 55 04 01"	= "Nom d’entrada amb àlies";
"06 03 55 04 02"	= "Informació de coneixement";
"06 03 55 04 03"	= "Nom comú";
"06 03 55 04 04"	= "Cognoms";
"06 03 55 04 05"	= "Número de sèrie";
"06 03 55 04 06"	= "Nom de país";
"06 03 55 04 07"	= "Nom de localitat";
"06 04 55 04 07 01"	= "Nom col·lectiu de localitat";
"06 03 55 04 08"	= "Nom d’Estat o província";
"06 04 55 04 08 01"	= "Nom d’estat o província";
"06 03 55 04 09"	= "Adreça postal";
"06 04 55 04 09 01"	= "Adreça postal col·lectiva";
"06 03 55 04 0A"	= "Nom de l’empresa";
"06 04 55 04 0A 01"	= "Nom institucional col·lectiu";
"06 03 55 04 0B"	= "Nom d’unitat institucional";
"06 04 55 04 0B 01"	= "Nom col·lectiu d’unitat institucional";
"06 03 55 04 0C"	= "Títol";
"06 03 55 04 0D"	= "Descripció";
"06 03 55 04 0E"	= "Guia de cerca";
"06 03 55 04 0F"	= "Categoria empresarial";
"06 03 55 04 10"	= "Adreça postal";
"06 04 55 04 10 01"	= "Adreça postal col·lectiva";
"06 03 55 04 11"	= "Codi postal";
"06 04 55 04 11 01"	= "Codi postal col·lectiu";
"06 03 55 04 12"	= "Apartat de correus";
"06 04 55 04 12 01"	= "Apartat de correus col·lectiu";
"06 03 55 04 13"	= "Nom d’oficina d’entrega física";
"06 04 55 04 13 01"	= "Nom d’oficina d'entrega física col·lectiu";
"06 03 55 04 14"	= "Número de telèfon";
"06 04 55 04 14 01"	= "Número de telèfon col·lectiu";
"06 03 55 04 15"	= "Número de tèlex";
"06 04 55 04 15 01"	= "Número de tèlex col·lectiu";
"06 03 55 04 16"	= "Identificador de terminal Teletext";
"06 04 55 04 16 01"	= "Identificador de terminal de teletext col·lectiu";
"06 03 55 04 17"	= "Número de telèfon de fax";
"06 04 55 04 17 01"	= "Número de telèfon de fax col·lectiu";
"06 03 55 04 18"	= "Adreça X.121";
"06 03 55 04 19"	= "Número XDSI internacional";
"06 04 55 04 19 01"	= "Número XDSI internacional col·lectiu";
"06 03 55 04 1A"	= "Adreça registrada";
"06 03 55 04 1B"	= "Indicador de destinació";
"06 03 55 04 1C"	= "Mètode d'entrega preferit";
"06 03 55 04 1D"	= "Adreça de presentació";
"06 03 55 04 1E"	= "Context d’aplicació compatible";
"06 03 55 04 1F"	= "Membre";
"06 03 55 04 20"	= "Propietari";
"06 03 55 04 21"	= "Responsable de la funció";
"06 03 55 04 22"	= "Vegeu també";
"06 03 55 04 23"	= "Contrasenya d’usuari";
"06 03 55 04 24"	= "Certificat d’usuari";
"06 03 55 04 25"	= "Certificat de CA";
"06 03 55 04 26"	= "Llista de revocació d’autoritat";
"06 03 55 04 27"	= "Llista de revocació de certificats";
"06 03 55 04 28"	= "Parell de certificats encreuats";
"06 03 55 04 29"	= "Nom";
"06 03 55 04 2A"	= "Nom de pila";
"06 03 55 04 2B"	= "Inicials";
"06 03 55 04 2C"	= "Qualificador de generació";
"06 03 55 04 2D"	= "Identificador únic";
"06 03 55 04 2E"	= "Qualificador DN";
"06 03 55 04 2F"	= "Guia de cerca millorada";
"06 03 55 04 30"	= "Dades del protocol";
"06 03 55 04 31"	= "DN";
"06 03 55 04 32"	= "Membre únic";
"06 03 55 04 33"	= "Identificador d’habitatge";
"06 03 55 04 34"	= "Algorismes compatibles";
"06 03 55 04 35"	= "Llista de revocació delta";
"06 03 55 04 36"	= "Autorització";
"06 03 55 04 3A"	= "Parell de certificats encreuats";

/* X.500 object classes */

"06 02 55 06"		= "Classe d’objecte X.520";
"06 03 55 06 00"	= "Superior";
"06 03 55 06 01"	= "Àlies";
"06 03 55 06 02"	= "País";
"06 03 55 06 03"	= "Localitat";
"06 03 55 06 04"	= "Empresa";
"06 03 55 06 05"	= "Unitat institucional";
"06 03 55 06 06"	= "Persona";
"06 03 55 06 07"	= "Persona institucional";
"06 03 55 06 08"	= "Funció institucional";
"06 03 55 06 09"	= "Grup de noms";
"06 03 55 06 0A"	= "Resident";
"06 03 55 06 0B"	= "Procés d’aplicació";
"06 03 55 06 0C"	= "Entitat d’aplicació";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispositiu";
"06 03 55 06 0F"	= "Usuari amb autenticació sòlida";
"06 03 55 06 10"	= "Autoritat de certificació";
"06 03 55 06 11"	= "Grup de noms únics";
"06 03 55 06 15"	= "Usuari PKI";
"06 03 55 06 16"	= "CA PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Algorismes X.500";
"06 03 55 08 01"	= "Algorismes d’encriptació X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Ampliacions de certificat X.509";
"06 03 55 1D 01"	= "Identificador de clau d’autoritat (antic)";
"06 03 55 1D 02"	= "Atributs de clau primària (antics)";
"06 03 55 1D 03"	= "Polítiques del certificat (antigues)";
"06 03 55 1D 04"	= "Restricció de l’ús de la clau (antic)";
"06 03 55 1D 05"	= "Assignació de polítiques (antigues)";
"06 03 55 1D 06"	= "Restricció de subdirectoris";
"06 03 55 1D 07"	= "Nom alternatiu del subjecte (antic)";
"06 03 55 1D 08"	= "Nom alternatiu de l’emissor (antic)";
"06 03 55 1D 09"	= "Atributs de directori del subjecte";
"06 03 55 1D 0A"	= "Restriccions bàsiques (abans, 2.5.29.10)";
"06 03 55 1D 0B"	= "Restriccions de nom (antigues)";
"06 03 55 1D 0C"	= "Restriccions de política (antigues)";
"06 03 55 1D 0D"	= "Restriccions bàsiques (abans, 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificador de clau del subjecte";
"06 03 55 1D 0F"	= "Ús de la clau";
"06 03 55 1D 10"	= "Període d’ús de la clau privada";
"06 03 55 1D 11"	= "Nom alternatiu del subjecte";
"06 03 55 1D 12"	= "Nom alternatiu de l’emissor";
"06 03 55 1D 13"	= "Restriccions bàsiques";
"06 03 55 1D 14"	= "Número de llista de revocació de certificats";
"06 03 55 1D 15"	= "Codi de raó de CRL";
"06 03 55 1D 16"	= "Data de caducitat (antiga)";
"06 03 55 1D 17"	= "Codi d’instrucció de suspensió";
"06 03 55 1D 18"	= "Data d’invalidesa";
"06 03 55 1D 19"	= "Punts de distribució de CRL (antics)";
"06 03 55 1D 1A"	= "Punt de distribució d’emissió (antic)";
"06 03 55 1D 1B"	= "Indicador de CRL delta";
"06 03 55 1D 1C"	= "Punt de distribució d’emissió";
"06 03 55 1D 1D"	= "Emissor del certificat";
"06 03 55 1D 1E"	= "Restriccions de nom";
"06 03 55 1D 1F"	= "Punts de distribució de CRL";
"06 03 55 1D 20"	= "Polítiques del certificat";
"06 04 55 1D 20 00"	= "Qualsevol identificador de política";
"06 03 55 1D 21"	= "Assignacions de polítiques";
"06 03 55 1D 22"	= "Restriccions de política";
"06 03 55 1D 23"	= "Identificador de clau d’autoritat";
"06 03 55 1D 24"	= "Restriccions de política";
"06 03 55 1D 25"	= "Ús de clau ampliat";
"06 04 55 1D 25 00"	= "Usos de clau ampliada";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algorisme de firma SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algorisme de firma Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algorisme de confidencialitat SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algorisme de confidencialitat Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algorisme d’integritat SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algorisme d’integritat Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algorisme de protecció de senyal SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algorisme de protecció de senyal Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algorisme de gestió de claus SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algorisme de gestió de claus Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algorisme de firma i de gestió de claus SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algorisme de firma i de gestió de claus Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algorisme de firma Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algorisme de confidencialitat Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algorisme d’integritat Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algorisme de protecció de senyal Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algorisme de gestió de claus Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algorisme de firma i de gestió de claus Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algorisme de firma actualitzada Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algorismes de firma actualitzada i de gestió de claus Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algorisme d’integritat actualitzada Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algorisme d’intercanvi de claus";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algorisme Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algorisme d’encriptació de claus (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Format de missatge RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Contingut buit";
"06 09 60 86 48 01 65 02 01 02 03"	= "Tipus de contingut CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Tipus de contingut MSP Rev. 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Tipus de contingut MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocol MSP Rekey Agent";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Tipus de contingut MSP Rev. 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Part del cos del missatge MSP reenviat";
"06 09 60 86 48 01 65 02 01 02 49"	= "Paràmetres de missatge reenviat MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Part del cos del missatge CSP reenviat";
"06 09 60 86 48 01 65 02 01 02 51"	= "Paràmetres de missatge reenviat CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Política de seguretat SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Política de seguretat";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Genèrica";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Política de seguretat per omissió";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificat de gestió de claus SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificat de firma d’usuari SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certificat de firma i de gestió de claus SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificat de gestió de claus Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificat de firma i de gestió de claus Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificat de firma d’usuari Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificat de firma de CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificat de firma de CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vector auxiliar";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Política de confirmació";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Pertinença";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administradors";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "CKL Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL de firma SDNS Meta";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL de firma SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Llista de revocació de certificats SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Llista de revocació de certificats Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processador d’adreça exempta";
"06 09 60 86 48 01 65 02 01 05 30"	= "Protecció";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algorismes acceptats";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificat de gestió de claus Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certificat de firma i de gestió de claus Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificat de firma d’usuari Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Dades PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Restriccions de CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilegis de firma o gestió de claus";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilegis de comunicació";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribut etiquetat";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Arxiu de dades de política";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Arxiu de dades de la política de seguretat";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Restricció d’autorització de CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Ampliacions CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Categories de seguretat ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilegis d’etiqueta de seguretat estàndard";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilegis de firma";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilegis de gestió de claus";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilegi de grup d’etiquetes amb nom";
"06 09 60 86 48 01 65 02 01 0B 01"			= "Demo per al Regne Unit";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Classe 2 del Departament de Defensa dels EUA";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Classe 4 del Departament de Defensa dels EUA";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Classe 3 del Departament de Defensa dels EUA";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Classe 5 del Departament de Defensa dels EUA";
"06 09 60 86 48 01 65 02 01 0B 09"			= "PKI Classe 3 del Departament de Defensa dels EUA";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Política de seguretat de prova";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "Categories de seguretat TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Grup d’etiquetes TSP1 0";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Grup d’etiquetes TSP1 1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Grup d’etiquetes TSP1 2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Categories de seguretat TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Grup d’etiquetes TSP2 0";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Grup d’etiquetes TSP2 1";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Grup d’etiquetes TSP2 2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Categories de seguretat Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nom de grup d’etiquetes Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nom de grup d’etiquetes Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nom de grup d’etiquetes Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Entrada de CRL de prova";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etiqueta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identificador de política GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificador de política bàsica FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificador de política bàsica FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificador de política mitjana FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificador de política superior FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Clau KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Ampliacions";
"06 09 60 86 48 01 65 03 02 03 01"		= "Tècnica de recuperació de claus";
"06 09 60 86 48 01 65 03 02 03 02"		= "Compatible amb recuperació de claus";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recuperació de claus";
"06 08 60 86 48 01 65 03 02 04"			= "Esquemes de recuperació de claus";
"06 08 60 86 48 01 65 03 02 05"			= "Ampliació CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algorisme NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algorisme Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "Pad DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "Pad DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "Pad DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Pad RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 amb encriptació RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 amb encriptació RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 amb encriptació RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC amb SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC amb MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Pad RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Paquet MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Encriptació RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Contrasenya NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Tipus d’atribut PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atributs de seguretat";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Límit de dependència";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identificador d’objecte Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Ampliació de certificat de Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Tipus de certificat de Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL de base de Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL de revocació de Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL de revocació de CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL de descàrrega de CRL de Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL de descàrrega de certificats CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL de renovació de certificats de Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL de política de CA de Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL de la pàgina d’inici de certificats de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logotip de l’entitat de certificació de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Imatge d’usuari de certificats de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nom del servidor SSL de Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Comentari de certificat de Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Tipus de dades de Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imatge/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imatge/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Seqüència de certificat de Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL de certificat de Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identificador d’objecte de directori de Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definicions LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Permís de conduir";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Número de departament";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Número d’empleat";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tipus d’empleat";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Persona institucional de la intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Xifratge de passarel·la de servidor";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Ampliació de VPN Verisign desconeguda";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Ampliació de VPN Verisign desconeguda";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identificador de política Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Avís CPS v1 Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "CA Verisign SGC";

/* SET */

"06 03 67 2A 00"	= "Tipus de contingut";
"06 04 67 2A 00 00"	= "Dades PAN";
"06 04 67 2A 00 01"	= "Senyal PAN";
"06 04 67 2A 00 02"	= "Només PAN";

"06 03 67 2A 01"	= "Extensió del missatge";
"06 03 67 2A 02"	= "Camp";
"06 04 67 2A 02 00"	= "Nom complet";
"06 04 67 2A 02 01"	= "Nom de pila";
"06 04 67 2A 02 02"	= "Cognoms";
"06 04 67 2A 02 03"	= "Cognoms de naixement";
"06 04 67 2A 02 04"	= "Nom de lloc";
"06 04 67 2A 02 05"	= "Número d’identificació";
"06 04 67 2A 02 06"	= "Mes";
"06 04 67 2A 02 07"	= "Data";
"06 04 67 2A 02 08"	= "Adreça";
"06 04 67 2A 02 09"	= "Telèfon";
"06 04 67 2A 02 0A"	= "Quantitat";
"06 04 67 2A 02 0B"	= "Número de compte";
"06 04 67 2A 02 0C"	= "Contrasenya";

"06 03 67 2A 03"		= "Atribut";
"06 04 67 2A 03 00"		= "Certificat";
"06 05 67 2A 03 00 00"	= "Empremta digital de la clau arrel";
"06 05 67 2A 03 00 01"	= "Política addicional";

"06 03 67 2A 04"	= "Algorisme";
"06 03 67 2A 05"	= "Política";
"06 04 67 2A 05 00"	= "Arrel";
"06 03 67 2A 06"	= "Mòdul";
"06 03 67 2A 07"	= "Ampliació de certificat";
"06 04 67 2A 07 00"	= "Clau arrel amb hash";
"06 04 67 2A 07 01"	= "Tipus de certificat";
"06 04 67 2A 07 02"	= "Dades del beneficiari";
"06 04 67 2A 07 03"	= "Certificat de targeta obligatori";
"06 04 67 2A 07 04"	= "Túnel";
"06 04 67 2A 07 05"	= "Ampliacions SET";
"06 04 67 2A 07 06"	= "Qualificador SET";

"06 03 67 2A 08"	= "Marca";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Proveïdor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nacional";
"06 05 67 2A 0A E2 00"	= "Japó";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Clau arrel amb hash";
"06 04 86 8D 6F 03"	= "Tipus de certificat";
"06 04 86 8D 6F 04"	= "Dades del beneficiari";
"06 04 86 8D 6F 05"	= "Certificat de targeta obligatori";
"06 04 86 8D 6F 06"	= "Túnel";
"06 04 86 8D 6F 07"	= "Qualificador SET";
"06 04 86 8D 6F 63"	= "Dades SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Seguretat de dades d’Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identificador de política de confiança d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Política iSign d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Política bàsica X.509 d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Política SSL d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Política de generació de certificats locals d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Política de generació de CSR local d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Política de revocació CRL d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Política de revocació OCSP d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Política S/MIME d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Política d’autenticació ampliable d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Política de firma d’actualització de programari d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Política IPsec d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Política iChat d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Política de firma de recursos d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Política de client Kerberos d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Política de servidor Kerberos de Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Política de firma de codi d’Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Política de firma de paquets d’Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identificador d’algorisme de seguretat d’Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Encriptació el·líptica ràpida (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Compressió segura Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE amb firma MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE amb firma SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Encriptació FEED d’Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "FEED d’Apple (experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE amb firma ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identificador de certificat .Mac d’Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Petició de certificat .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Petició de certificat d’identitat .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Petició de certificat de firma de correu electrònic .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Petició de certificat d’encriptació de correu electrònic .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Petició de llista d’arxius comprimits .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Petició per desar arxius comprimits .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Petició d’obtenció d’arxius comprimits .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Petició de supressió d’arxius comprimits .Mac d’Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Ampliació de certificat .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identitat .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Firma de correu electrònic .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Encriptació de correu electrònic .Mac d’Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valor de petició de certificat .Mac d’Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nom d’usuari";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Contrasenya";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nom del servidor";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Renovar senyal";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Senyal asíncrona";

"06 08 2A 86 48 86 F7 63 64 04" = "Ús de clau ampliada d’Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Firma de codi d’Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Firma de codi d’Apple (desenvolupament)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Firma d’actualització de programari d’Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Firma de codi d’Apple (reservada)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Firma de recursos d’Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Firma iChat d’Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Encriptació iChat d’Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identitat de sistema Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Polítiques de certificació d’Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Política de certificació d’Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Política de certificació .Mac d’Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Firma de codi";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Seguretat CDSA d’Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formats de seguretat CDSA d’Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Ampliacions de certificat X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Ampliacions de certificat privat X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Mapa de bits de la firma del subjecte";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Imatge del subjecte";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Adreça de correu del subjecte";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Usar exempcions";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algorismes de seguretat CDSA d’Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 amb ECDSA";

/* end */
